app/views/admin/comments/_comment.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    <h4 class="card-title text-muted d-inline ">
      <%= User.find(comment.user_id).nick %>