app/views/comments/_comment.html.erb

    <h4 class="card-title text-muted d-inline ">
      <%= User.find(comment.user_id).nick %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]