app/controllers/admin/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.post_date = Time.now
    if @post.save
---
INSERT INTO "posts" ("title", "post_date", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])
    @post.post_date = Time.now
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "post_date" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Witajcie 3"], ["post_date", "2022-10-19 10:25:27.486848"], ["content", "Poważny post nr 1 asf\nediting111fa\nsaff"], ["updated_at", "2022-10-19 10:25:27.491339"], ["id", 1]]

  def myposts
    @myposts = Post.where(user_id: current_user)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 7]]