app/views/admin/posts/_post.html.erb

    <p class="d-inline mx-3 fs-5">
      <%= User.find(post.user_id).nick %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]