app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <p class="d-inline float-end fs-4 text-white mx-4 my-2">
        <%= User.find(@post.user_id).nick %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = ? LIMIT ?  [["post_id", 1], ["LIMIT", 1]]
---

    <% if !@post.comments.empty? %>