app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    respond_to do |format|
      format.html do
        @post = Post.find(params[:id])
      end
      format.pdf do
        @post = Post.find(params[:id])